{
    "Home": "الصفحة الرئيسية",
    "Are you measuring and elevating your Employee Engagement Level in your organization": "هل تقوم بقياس وتعزيز مستوى ارتباط الموظفين في منظمتك؟",
    "Our Methodology:": "منهجيتنا:",
    "For employees to contribute optimally, organizations need to engage the whole person’s;": "لكي يسهم الموظفون بشكل مثلى، تحتاج المنظمات إلى جذب الشخص بأكمله؛",
    "Engaging the heart is the center of employee engagement. When the heart is engaged, the mind will be stimulated to think. When the heart and mind are active, the human being must be enabled to give hand.": "جذب القلب هو مركز ارتباط الموظفين. عندما يشترك القلب، سيتم تحفيز العقل للتفكير. عندما يكون القلب والعقل نشطين، يجب تمكين الإنسان من المساهمة.",
    "Employee Engagement:": "ارتباط الموظفين:",
    "The emotional, mental and physical connection of employees to the organization that drives an extraordinary personal contribution that achieves a win-win situation for a better employee happiness and organizational outcome.": "الارتباط العاطفي والعقلي والجسدي للموظفين بالمنظمة الذي يدفع المساهمة الشخصية الاستثنائية التي تحقق حالة رابحة للموظف والنتائج التنظيمية الأفضل.",
    "Heart": "القلب",
    "Emotional Connection": "الارتباط العاطفي",
    "Head": "العقل",
    "Intellectual Stimulation": "التحفيز الفكري",
    "Hand": "اليد",
    "Enablement": "تمكين",
    "80% Emotional Connection": "80% ارتباط عاطفي",
    "55% Intellectual Stimulation": "55% تحفيز فكري",
    "33% Enablement": "33% تمكين",
    "Contact :": "اتصال:",
    "Employee EngagementExpert": "خبير ارتباط الموظفين",
    "Or Clients Happiness Champion:": "أو بطل سعادة العملاء:",
    "Employee Net Promotor Score (eNPS)": "درجة صافي المروجين للموظفين (eNPS)",
    "How likely to recommend XXX as a good place to work?": "مدى احتمالية أن توصي بـ XXX كمكان جيد للعمل؟",
    "Login": "تسجيل الدخول",
    "Email Address": "عنوان البريد الإلكتروني",
    "Password": "كلمة المرور",
    "Control Panel": "لوحة التحكم",
    "Logout": "تسجيل الخروج",
    "Forgot Your Password?": "هل نسيت كلمة المرور؟",
    "Change Password": "تغيير كلمة المرور",
    "Remember Me": "تذكرني",
    "Muath Al Musalmi": "معاذ المسلمي",
    "Nabahan Al Kharusi": "نبهان الخروصي"
}